```
------------------------------------------------------------------------
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.srinivasu_seeram.aws_iam_user.default will be created
  + resource "aws_iam_user" "default" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "srinivasu.seeram@reisystems.com"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # module.srinivasu_seeram.aws_iam_user_group_membership.default will be created
  + resource "aws_iam_user_group_membership" "default" {
      + groups = [
          + "developers",
        ]
      + id     = (known after apply)
      + user   = "srinivasu.seeram@reisystems.com"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------
```